Revit 2027 API
AnnotationLabel.UseNonBreakingSpaces Property
 If non-breaking spaces should be used in the label text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseNonBreakingSpaces { get; }
Public ReadOnly Property UseNonBreakingSpaces As Boolean
	Get
public:
property bool UseNonBreakingSpaces {
	bool get ();
}
member UseNonBreakingSpaces : bool with get
Property Value
Boolean
Remarks
 Set use non-breaking spaces to true if you want to control the text wrapping yourself.
See Also
Reference
AnnotationLabel Class
Autodesk.Revit.DB Namespace